### File Handling

In [2]:
#Define a function to read file data for a given file

def readfile(filename):
    f= open(filename,'r')
    filedata=f.read()
    return filedata

filename='datafiles/data.txt'
readfile(filename)

'Course Objectives:\nTo introduce programming through Visual programming tool - Scratch\nTo teach problem solving through Flow charting tool - Raptor\nTo elucidate problem solving through python programming language\nTo introduce  function-oriented programming paradigm through python\nTo train in development of  solutions using modular concepts\nTo teach practical Pythonic solution patterns\n'

In [5]:
import re
def readfile(filename):
    f= open(filename,'r')
    filedata=f.read()#Returns a list of lines in the file
    return filedata

filename='datafiles/data.txt'
#len(re.split('\',readfile(filename)))#number of words

wordlist =re.split('\ ',readfile(filename))
wordlist

['Course',
 'Objectives:\nTo',
 'introduce',
 'programming',
 'through',
 'Visual',
 'programming',
 'tool',
 '-',
 'Scratch\nTo',
 'teach',
 'problem',
 'solving',
 'through',
 'Flow',
 'charting',
 'tool',
 '-',
 'Raptor\nTo',
 'elucidate',
 'problem',
 'solving',
 'through',
 'python',
 'programming',
 'language\nTo',
 'introduce',
 '',
 'function-oriented',
 'programming',
 'paradigm',
 'through',
 'python\nTo',
 'train',
 'in',
 'development',
 'of',
 '',
 'solutions',
 'using',
 'modular',
 'concepts\nTo',
 'teach',
 'practical',
 'Pythonic',
 'solution',
 'patterns\n']

In [ ]:
import re
def readfile(filename):
    f= open(filename,'r')
    filedata=f.read()#Returns a list of lines in the file
    f.close()
    return filedata

filename='datafiles/data.txt'
#len(re.split('\ ',readfile(filename)))#number of words

#wordlist =re.split('\ ',readfile(filename))
#wordlist

# frequency of data

In [ ]:
Unique data in the form of a Dictionary
       {'To':0,"introduce":0.....}
Calculate the frequency for all keys in the Dictionary
      For Every key in Dictionary:
          count the number of times the key is repeating in the data
        Assign the count of each key to the corresponding to dictionary values

In [6]:
#Function to extract unique words in a text file
import re
def extractuniquewords(filename):
    filedata = readfile(filename)
    wordlist=re.split('\ ',filedata)
    uniquewords={}
    for word in wordlist:
        if word not in uniquewords.keys():
            uniquewords[word]= 1
    return uniquewords
filename='datafiles/data.txt'

extractuniquewords(filename)

{'Course': 1,
 'Objectives:\nTo': 1,
 'introduce': 1,
 'programming': 1,
 'through': 1,
 'Visual': 1,
 'tool': 1,
 '-': 1,
 'Scratch\nTo': 1,
 'teach': 1,
 'problem': 1,
 'solving': 1,
 'Flow': 1,
 'charting': 1,
 'Raptor\nTo': 1,
 'elucidate': 1,
 'python': 1,
 'language\nTo': 1,
 '': 1,
 'function-oriented': 1,
 'paradigm': 1,
 'python\nTo': 1,
 'train': 1,
 'in': 1,
 'development': 1,
 'of': 1,
 'solutions': 1,
 'using': 1,
 'modular': 1,
 'concepts\nTo': 1,
 'practical': 1,
 'Pythonic': 1,
 'solution': 1,
 'patterns\n': 1}

In [8]:
import re
def extractuniquewords(filename):
    filedata = readfile(filename)
    wordlist=re.split('\ ',filedata)
    uniquewords={}
    for word in wordlist:
        if word not in uniquewords.keys():
            uniquewords[word]= 1
    return uniquewords
filename='datafiles/data.txt'

uniquewords=extractuniquewords(filename)

#Function to calculate the frequency of words from given data

def frequencytable(data,uniquedata):
    for word in uniquedata.keys():
        uniquedata[word]=len(re.findall(word,data))
    return uniquedata
filedata=readfile(filename)
frequencytable(filedata,uniquewords)

{'Course': 1,
 'Objectives:\nTo': 1,
 'introduce': 2,
 'programming': 4,
 'through': 4,
 'Visual': 1,
 'tool': 2,
 '-': 3,
 'Scratch\nTo': 1,
 'teach': 2,
 'problem': 2,
 'solving': 2,
 'Flow': 1,
 'charting': 1,
 'Raptor\nTo': 1,
 'elucidate': 1,
 'python': 2,
 'language\nTo': 1,
 '': 388,
 'function-oriented': 1,
 'paradigm': 1,
 'python\nTo': 1,
 'train': 1,
 'in': 12,
 'development': 1,
 'of': 1,
 'solutions': 1,
 'using': 1,
 'modular': 1,
 'concepts\nTo': 1,
 'practical': 1,
 'Pythonic': 1,
 'solution': 2,
 'patterns\n': 1}

In [7]:
re.findall('p','pythonprogramming')

['p', 'p']

In [ ]:
import pandas as dp
def readcsv_






tf(df)
df.columns

for row in df.values:
    print(row[0],':',)-

In [ ]:
##Matplotlib
line plot
bar plot
scatter plot#plt.scatter

import matplotlib.pyplot as plt
import matplotlib.

In [ ]:
read_csv to read the csv files
read_excel to read the xlsx files

In [14]:
import pandas as pd
data=pd.read_csv(r"C:\Users\naresh\Documents\sample.csv")
data

     4  name swathi
0   3;  name  vyshu
1    6  name    sai
2   65   NaN     65
3   66   NaN    656
4    5   NaN    565
5    6   NaN      4
6  NaN   NaN    NaN
7    6   NaN    NaN
8    6   NaN    NaN

In [48]:
df=pd.DataFrame({'Name':['alex','bob','aadi'],'Age':[10,12,14]})
df

   Name  Age
0  alex   10
1   bob   12
2  aadi   14

In [51]:
df=pd.DataFrame({'Class':[2,3,4,5,6]})

In [20]:
df.columns

Index(['Name', 'Age'], dtype='object')

In [21]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [22]:
df.head()

   Name  Age
0  alex   10
1   bob   12
2  aadi   14

In [23]:
data.head(2)

    4  name swathi
0  3;  name  vyshu
1   6  name    sai

In [24]:
data.tail(1)

   4 name swathi
8  6  NaN    NaN

In [25]:
data.shape

(9, 3)

In [27]:
data.rename(columns={'Name':'name'})

     4  name swathi
0   3;  name  vyshu
1    6  name    sai
2   65   NaN     65
3   66   NaN    656
4    5   NaN    565
5    6   NaN      4
6  NaN   NaN    NaN
7    6   NaN    NaN
8    6   NaN    NaN

In [ ]:
data.rename()

### Axis=0-rows,1-columns

In [41]:
df.drop('Age',axis=1).head(2)

   Name
0  alex
1   bob

In [31]:
data.drop([1],axis=0).head(2)

    4  name swathi
0  3;  name  vyshu
2  65   NaN     65

In [36]:
data.name

0    name
1    name
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
8     NaN
Name: name, dtype: object

In [35]:
data['name']

0    name
1    name
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
8     NaN
Name: name, dtype: object

### loc-used for accessing with the lables

In [43]:
data.loc[1]['name']

'name'

In [44]:
data.iloc[1][0]#Accessing the index of the column

'6'

In [45]:
data.set_index('name')

        4 swathi
name
name   3;  vyshu
name    6    sai
NaN    65     65
NaN    66    656
NaN     5    565
NaN     6      4
NaN   NaN    NaN
NaN     6    NaN
NaN     6    NaN

In [60]:
df2=pd.DataFrame({'Class':[2,3,4,5,6]})

In [61]:
pd.concat((data,df2),axis=1)

     4  name swathi  Class
0   3;  name  vyshu    2.0
1    6  name    sai    3.0
2   65   NaN     65    4.0
3   66   NaN    656    5.0
4    5   NaN    565    6.0
5    6   NaN      4    NaN
6  NaN   NaN    NaN    NaN
7    6   NaN    NaN    NaN
8    6   NaN    NaN    NaN

In [59]:
type(df)

pandas.core.frame.DataFrame

In [63]:
data.sort_values('name')

     4  name swathi
0   3;  name  vyshu
1    6  name    sai
2   65   NaN     65
3   66   NaN    656
4    5   NaN    565
5    6   NaN      4
6  NaN   NaN    NaN
7    6   NaN    NaN
8    6   NaN    NaN

In [65]:
df.sort_values('Class')

   Class
0      2
1      3
2      4
3      5
4      6

In [66]:
df.Class.sort_values()

0    2
1    3
2    4
3    5
4    6
Name: Class, dtype: int64

In [68]:
df.sort_values('Class',ascending= False)

   Class
4      6
3      5
2      4
1      3
0      2

In [73]:
data.drop_duplicates()

     4  name swathi
0   3;  name  vyshu
1    6  name    sai
2   65   NaN     65
3   66   NaN    656
4    5   NaN    565
5    6   NaN      4
6  NaN   NaN    NaN
7    6   NaN    NaN

In [72]:
df.duplicated().sum()

0